[
    {
        "id": 1659092460,
        "title": "Oak & Co For New Homes UI Design\r",
        "author": "Michael Sokan\r",
        "description": "No description given",
        "date": "July 29, 2022",
        "link": "No link given",
        "time": "12:01",
        "image": "/images/oak-co-website-01.png\r",
        "image2": "/images/oak-co-website-02.png\r",
        "image3": "/images/oak-co-website-06.png\r",
        "image4": "/images/oak-co-website-05.png\r",
        "content": "The idea behind Oak & Co was to build an open source Property management and development application in React.js Story Book UI components library to help developers to create high quality entreprise application. With that in mind, we also want the components to be easily integrated and customized to match any existing application without messing with existing styles. The client wanted to update their website, so I worked on creating a new look from scratch. \r\n\r\nThe client was looking for something that has a professional design that would attract more customers. My role for this project for a property management company was to design a website that achieved their goals of providing a good experience for their customers. After the project ended, the client was extremely satisfied with the results and they were very happy with their new website to go on to the developer team to be built."
    },
    {
        "id": 1659079740,
        "title": "The Wine Society UI Design and Design System\r",
        "author": "Michael Sokan\r",
        "description": "No description given",
        "date": "July 29, 2022",
        "link": "https://www.thewinesociety.com\r",
        "time": "08:29",
        "image": "/images/screencapture-thewinesociety-2022-07-23-22_41_54.png\r",
        "image2": "/images/screencapture-thewinesociety-become-a-member-join-2022-07-23-22_57_56.png\r",
        "image3": "/images/screencapture-thewinesociety-buy-wines-red-wine-france-bordeaux-2022-07-23-22_54_42.png\r",
        "image4": "/images/screencapture-thewinesociety-en-primeur-bordeaux-2021-buy-red-wines-by-dozen-2022-07-23-22_59_59.png\r",
        "content": "The Wine Society is an online wine-buying club for avid wine drinkers. The website is powered by the Optimizely Digital Experience and offers a personalised experience for each customer. The company's site was in need of an update, and the design had to be completely overhauled as the overall UX and UI design necessitated a significant amount of effort. \r\n\r\nIt is because it didn't aim to solve users' problems or it wasn't built with a design system that would ensure managing design at scale using reusable, systemized and cohesive components and styles. As the project has been developed finished and the design system is fully created you can now see the finished site by clicking the link below.\r\n\r\nDesign System:\r\n\r\n<https://tws-accessibility.netlify.app/>"
    },
    {
        "id": 1659043020,
        "title": "Different Dog Ecommerece UI Design\r",
        "author": "Michael Sokan\r",
        "description": "Different Dog UI Design pages\r",
        "date": "July 28, 2022",
        "link": "https://www.differentdog.com/\r",
        "time": "22:17",
        "image": "/images/differentdog/HomeScreen-f38bf.jpeg\r",
        "image2": "/images/differentdog/Productdetail-0998a.jpeg\r",
        "image3": "/images/differentdog/ShoppingCart-Step1-22368.jpeg\r",
        "image4": "/images/differentdog/Blog-7c483.jpeg\r",
        "content": "\r\n*Different Dog is a website that I designed with a team for a healthy dog and pet food and accessories e-commerce business who set out to prove that hand-cooking food with real ingredients would change dogs’ lives. Since day one, customers have been telling us that after our food, their dog is a different dog. The website features a Menu with all the items and their ingredients on it so you can get an idea of what was offered. \r\n\r\nThe Different Dog was designed to be appealing and informative for prospective users before the web app release, informing them about what to anticipate and encouraging them to search, sign up for the to help provide the best health for your dog and stay connected. I focused on making it simple for site visitors to discover what they need and join the queue easily by placing CTAs effectively both in the home banner and above the footer. \r\n\r\nFresh dog food, made with 100% British meat, delivered to your door Nutritionist-designed recipes, with no grains, legumes or nasties. Fussy dog approved, we even guarantee empty bowls and positive news when taking dog to the vet. Access to our in-house vet and pet nutritionist for free advice to bring the best out of your pets. \r\n\r\nAs the company is growing fast, it was important to build a design system at scale so that it will constantly evolve and develop with an ease of use and maintenance. The design system has of a style guide and UI components such as typography, colors, grid systems, icons, buttons, checkboxes, profiles, UI cards, navigation and footers, and so on. I ensured that the process of building the website throughout the design and frontend development is carried out swiftly and efficiently with this design system. With documentation of the css, interaction and use of the components for the developers, I also made sure that the delivery of UI Design would be faster and the end result as similar to the design as possible.*\r\n"
    },
    {
        "id": 1659042120,
        "title": "Grants Payment System UI Design\r",
        "author": "Michael Sokan\r",
        "description": "Grants Payment UI Design pages\r",
        "date": "July 28, 2022",
        "link": "\"\"\r",
        "time": "22:02",
        "image": "/images/grants-payment-imgfocus.png\r",
        "image2": "/images/dashboard-640f9.jpeg\r",
        "image3": "/images/accountsandcards-d2291.jpeg\r",
        "image4": "/images/verify-c7a62.jpeg\r",
        "content": "Grants Payment is a new payment system with a sleek UI design. It is built with React.js components and the latest frontend enterprise technology. It has been designed it to make it as easy as possible for you to use!\r\n\r\nIn this case study I had to help an epos system selling company that wanted to update their website. I started by researching their competitors to be able to create a new look for their site from scratch which will stand out. The client was looking for something that has a professional design that would attract more customers. My role for this project was to create a good web experience for their audience by using my design skills and research. They were pleased with the results and I am current working on the frontend development of this website.\r\n"
    },
    {
        "id": 1659097920,
        "title": "Ottilus Streaming App UI Design\r",
        "author": "Michael Sokan\r",
        "description": "No description given",
        "date": "July 29, 2022",
        "link": "\"\"\r",
        "time": "13:32",
        "image": "/images/section-21-01.png\r",
        "image2": "/images/ottilus_ipad-development-01.jpg\r",
        "image3": "/images/ottilus-mobile-2-.jpg\r",
        "image4": "/images/section-10.png\r",
        "content": "Ottilus Streaming App is your reliable streaming application solutions, and it is now also perceived as such from the outside. For this project, I was involved in the design of some parts of the website and mobile app (i.e. the navigation, the featured page/home page, the footer, the contact page, the search page, the favourites page, the streaming player) and the detailing of specifications for the developers. I was involved in the rebranding process, I curated the guidelines regarding the online channel and created the animation showing the evolution of the Ottilus's logo. \r\n\r\nThis project is part of a teamwork at Sintec Media Group. Other Information: The idea behind Ottilus Streaming App was to build an open source TV on-demand application in AngularJS and Handlebars.js within our MVC Zend Framework to help my fellow backend developers to create high quality entreprise application. With that in mind, we also want the components to be easily integrated and customized to match any existing application without messing with existing styles."
    },
    {
        "id": 1659097620,
        "title": "Brand Healthcare UI Design\r",
        "author": "Michael Sokan\r",
        "description": "No description given",
        "date": "July 29, 2022",
        "link": "https://www.brandhealthcare.co.uk/\r",
        "time": "13:27",
        "image": "/images/screencapture-brandhealthcare-co-uk-2022-07-24-17_31_28.png\r",
        "image2": "/images/screencapture-brandhealthcare-co-uk-jobscareers-2022-07-24-17_32_02.png\r",
        "image3": "/images/screencapture-brandhealthcare-co-uk-locations-2022-07-24-17_32_13.png\r",
        "image4": "/images/screencapture-brandhealthcare-co-uk-aboutus-2022-07-24-17_31_49.png\r",
        "content": "Brand Healthcare is reinventing primary care from the ground up. They are fiercely determined to help adults 65+ get the care and experience they deserve. In order to bring a design-centered approach to their product and brand development, the team from Brand Healthcare worked with React StoryBook to design an iconic brand identity and product design system that is authentic, distinct and accessible."
    },
    {
        "id": 1659097260,
        "title": "Oblivion Soundtrack Website Design\r",
        "author": "Michael Sokan\r",
        "description": "No description given",
        "date": "July 29, 2022",
        "link": "No link given",
        "time": "13:21",
        "image": "/images/62dd628aa1f55a36f09b31de.jpg\r",
        "image2": "/images/62dd6293a1f55a36f09b31e0.jpg\r",
        "image3": "No image given",
        "image4": "No image given",
        "content": "UI Website Design for the Oblivion movie soundtrack. Digital Media Services"
    },
    {
        "id": 1659096720,
        "title": "Convertr Media UI Design\r",
        "author": "Michael Sokan\r",
        "description": "No description given",
        "date": "July 29, 2022",
        "link": "No link given",
        "time": "13:12",
        "image": "/images/screencapture-convertr-io-product-data-optimization-and-routing-2022-07-24-18_27_14.png\r",
        "image2": "/images/screencapture-convertr-io-about-our-story-2022-07-24-18_28_56.png\r",
        "image3": "/images/screencapture-convertr-io-customers-agencies-2022-07-24-18_28_12.png\r",
        "image4": "/images/screencapture-convertr-io-demo-2022-07-24-18_28_32.png\r",
        "content": "Convertr Media is a software created to understand, analyse help businesses better themselves using our progressive, profitable and scalable lead generation platform system that provides quality results through automation, synchronization and a connected ecosystem. \r\n\r\nThe benefits of the platform exceute more reliable and better campaigns results for business websites. The mission consisted in establishing brand guidelines and creating graphical elements, and then to redesign the new website and the print ads, and finally to create a motion design introducing all the software’s features."
    },
    {
        "id": 1659096480,
        "title": "Stax Of Stories E-commerce UI Design\r",
        "author": "Michael Sokan\r",
        "description": "No description given",
        "date": "July 29, 2022",
        "link": "No link given",
        "time": "13:08",
        "image": "/images/portfolio-1.png\r",
        "image2": "/images/portfolio-2.png\r",
        "image3": "/images/portfolio-3.png\r",
        "image4": "No image given",
        "content": "The idea behind Stax Of Stories to build an open source Book Shop application in React.js components library to help me develop and create high quality backend and frontend entreprise application. With that in mind, I also want the components to be easily integrated and customized to match any existing application without messing with existing styles."
    },
    {
        "id": 1659096360,
        "title": "Sky Product and Brand UI Design System\r",
        "author": "Michael Sokan\r",
        "description": "No description given",
        "date": "July 29, 2022",
        "link": "https://www.sky.com/toolkit\r",
        "time": "13:06",
        "image": "/images/today-sky.jpg\r",
        "image2": "/images/knowledge-base.jpg\r",
        "image3": "/images/sky-light-box.jpg\r",
        "image4": "/images/the-people-s-rainforest.jpg\r",
        "content": "The Sky Product Design System Toolkit. Put together by myself and fellow sky designers. For a central resource for all designers and developers in the company to understand how to design and build digital products for Sky. \r\n\r\nAbove screens are projects I designed using the Sky design system toolkit"
    },
    {
        "id": 1659095940,
        "title": "Bread Factory Web App UI Design\r",
        "author": "Michael Sokan\r",
        "description": "No description given",
        "date": "July 29, 2022",
        "link": "https://jobs.thebreadfactory.co.uk/\r",
        "time": "12:59",
        "image": "/images/screencapture-jobs-thebreadfactory-co-uk-2022-07-24-15_51_02.png\r",
        "image2": "/images/screencapture-breadltd-co-uk-about-us-2022-07-24-15_48_20.png\r",
        "image3": "/images/screencapture-breadltd-co-uk-become-a-customer-2022-07-24-15_48_47.png\r",
        "image4": "/images/screencapture-breadltd-co-uk-join-us-2022-07-24-15_46_58.png\r",
        "content": "I aimed to design UI elements and the visuals that are super clean, minimal and attractive. I focused on getting rid of anything that doesn't serve a purpose or improve the user experience in some way. Minimal design doesn't mean it looks boring. \r\n\r\nI didn't want to overwhelm users with too much information scattered all over the site because The Bread Factory had a lot to offer their clients. By effectively utilizing certain clear and white spaces to organize information clearly and displaying beautiful visual designs, I was able to produce a clean and attractive website."
    },
    {
        "id": 1659095280,
        "title": "FSI HR Web App UI Design\r",
        "author": "Michael\r",
        "description": "No description given",
        "date": "July 29, 2022",
        "link": "No link given",
        "time": "12:48",
        "image": "/images/dashboard-8d166.jpeg\r",
        "image2": "/images/accountprofile-96a38.jpeg\r",
        "image3": "/images/applicationtracker-7b1f2.jpeg\r",
        "image4": "/images/signup-5a6ba.jpeg\r",
        "content": "The corporate website application and product configurator were a big part of the whole redesign of the user experience. I was responsible for the whole redesign of their website and design system, from the wireframe to the final specifications to the developers. Besides their website, I led the design of the product configurator and the development of a hi-fi prototype. \r\n\r\nI was involved in the rebranding process, I curated the guidelines regarding the online channel and created the animation showing the evolution of the logo. Other Information: The idea behind FSI FM HR was built from an open source application that uses widgets and other UI features that will allow clients to build end to end application This is know as Dreamscapes Widgets."
    }
]